"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: Задание 21.py
Автор: 2020 © А.С. Манукян, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 12/12/2020
Дата последней модификации: 12/12/2020
Описание: Решение задачи № 21
#версия Python:3.9
"""
Определить значение функции Z=1/X*Y при производных X и Y.
""
X=int(input("Введите X:"))
Y=int(input("Введите Y:"))
Z=1/X*Y
print("Значение ф-ии равно",Z)
